# Description Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Segment..::..Description Property
Segment Class See Also
---
The description of the segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string Description { get; set; }
```

Visual Basic
---
```text
Public Property Description As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
Segment Class
Autodesk.Revit.DB Namespace